<a href="https://colab.research.google.com/github/AbishekMishra183/data-science-ml-journey/blob/main/day16_python_database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

In [ ]:
con=sqlite3.connect('students1.sqlite3')

In [ ]:
cur =con.cursor()

In [ ]:
create_table_query="""
CREATE TABLE student(
	id int primary key,
	name varchar not null,
	address varchar not null,
	college varchar not null,
	age int not null,
	gender varchar(1) not null,
	faculty varchar not null

);
"""
cur.execute(create_table_query)

In [ ]:
insert_records="""

INSERT INTO student
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty')
VALUES
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT'),
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT'),
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE'),
(4, 'sita', 'kathmandu', 'pulchwok', 25, 'f', 'CE');
"""
cur.execute(insert_records)

In [ ]:
con.commit()

In [ ]:
students=cur.execute("SELECT * FROM student;")
for student in students:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE')
(4, 'sita', 'kathmandu', 'pulchwok', 25, 'f', 'CE')

In [ ]:
# no need to commit for table realted operation
cur.execute("ALTER table student add university varchar default 'TU';")

In [ ]:

cur.execute("SELECT * FROM student WHERE  address='lalitpur';")
for student in students:
    print(student)

(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU')

In [ ]:

address = input("Enter address to search: ")


students=cur.execute(f"SELECT * FROM student WHERE address = '{address}';")



for student in students:
    print(student)

Enter address to search:  lalitpur

(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU')

In [ ]:
#SELECT * FROM student WHERE address = 'lalitpur' OR TRUE OR address = 'kathmandu';

In [ ]:

address = input("Enter address to search: ")


student=cur.execute("SELECT * FROM student WHERE address = ?", (address,))


for student in students:
    print(student)

Enter address to search:  lalitpur

(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU')

In [ ]:
student = (5, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'TU')

INSERT_RECORDS = """
INSERT INTO student
(id, name, address, college, age, gender, faculty, university)
VALUES (?, ?, ?, ?, ?, ?, ?, ?);
"""

cur.execute(INSERT_RECORDS, student)
con.commit()

In [ ]:
students=[
    (9, 'hariBahadur', 'kathmandu', 'ncit', 18, 'm', 'IT','pu'),
    (10, 'MadanBhandari', 'lalitpur', 'islington', 20, 'm', 'CSIT','TU'),
    (11, 'mayaDevi', 'pokhara', 'ncit', 21, 'f', 'SE','TU'),
]
INSERT_RECORDS = """
INSERT INTO student
(id, name, address, college, age, gender, faculty, university)
VALUES (?, ?, ?, ?, ?, ?, ?, ?);
"""

for student in students:
    cur.execute(INSERT_RECORDS, student)
    con.commit()

In [ ]:
INSERT_RECORDS = """
INSERT INTO student
(id, name, address, college, age, gender, faculty, university)
VALUES (?, ?, ?, ?, ?, ?, ?, ?);
"""

cur.execute(INSERT_RECORDS, student)
con.commit()
students=[
    (202, 'hariBahadur', 'kathmandu', 'ncit', 18, 'm', 'IT','pu'),
    (203, 'MadanBhandari', 'lalitpur', 'islington', 20, 'm', 'CSIT','TU'),
    (204, 'mayaDevi', 'pokhara', 'ncit', 21, 'f', 'SE','TU'),
]
INSERT_RECORDS = """
INSERT INTO student
(id, name, address, college, age, gender, faculty, university)
VALUES (?, ?, ?, ?, ?, ?, ?, ?);
"""

cur.executemany(INSERT_RECORDS, students)
con.commit()